app/Controllers/TravelController.php

    public function getPlans()
    {
        $planModel = new PlanModel();

        $plans = $planModel->where('user_id', session()->get('id'))->findAll();
---
SELECT *
FROM `plans`
WHERE `user_id` = '1'

    public function getPlan($planId)
    {
        $planModel = new PlanModel();
        $confirmationModel = new ConfirmationModel();

        $plan = $planModel->where([
            'id' => $planId,
            'user_id' => session()->get('id')
        ])->first();

        if (!$plan) {
            return redirect()->to('/plans')->with('error', 'Plan not found');
        }

        $confirmations = $confirmationModel->where('plan_id', $planId)
            ->orderBy('date', 'ASC')
            ->orderBy('time', 'ASC')
            ->findAll();
---
SELECT *
FROM `plans`
WHERE `id` = '4'
AND `user_id` = '1'
 LIMIT 1
SELECT *
FROM `confirmations`
WHERE `plan_id` = '4'
ORDER BY `date` ASC, `time` ASC