app/Models/FlightModel.php

    public function searchFlights($origin, $destination, $departDate)
    {
        $flights = $this->where([
            'departure_airport' => $origin,
            'arrival_airport' => $destination,
            'flight_date' => $departDate
        ])
        ->orderBy('price', 'ASC')
        ->limit(20)
        ->find();
---
SELECT *
FROM `flights`
WHERE `departure_airport` = 'SIN'
AND `arrival_airport` = 'CGK'
AND `flight_date` = '2025-01-10'
ORDER BY `price` ASC
 LIMIT 20